Repository: NikolayIT/OpenJudgeSystem
Catalog: Open Judge System/Web/OJS.Web/App_GlobalResources/Areas/Administration/Problems/Views/Partials/ProblemsPartials.*.resx
Languages: bg

source: Additional Files
bg: Допълнителни файлове

# Additional_files_label
source: Additional Files (.zip file)
bg: Допълнителни файлове (.zip формат)

# Case_insensitive_checker_description
source: - the system does uses case insensitive comparison when comparing symbol by symbol.
bg: - системата не отчита разлика между главна и малка буква като сравнява символ по символ;

# Choose_additional_file
source: Choose a .zip file with additional files that will be added to the user code.
bg: Избери .zip файл със допълнителни файлове които да се добавят към проекта на потребителя.

# Choose_code_checker
source: Choose a source code checker for this problem. The basic options are:
bg: Изберете тип проверка на сорс кода на състезателите. Базовите варианти са:

# Copy_in_new_problem_group
source: Copy into a new problem group
bg: Копирай в нова група от задачи

# Enter_max_points
source: Enter the max points for the problem
bg: Въведете максимален брой точки, които състезателят може да получи от задачата

# Enter_memory_limit
source: Enter the memory limit (in bytes) for this problem
bg: Въведете максималнa памет в байтове, която състезателят може да достигне с решението си върху задачата

# Enter_name
source: Enter the name of the problem
bg: Въведете заглавие на задачата

# Enter_order
source: Enter the order for the current problem
bg: Въведете номер под ред на задачата в текущото състезание

source: Enter solution skeleton
bg: Въведете скелет

# Enter_sorce_code_size_limit
source: Enter the source code size limit (in bytes) for this problem
bg: Въведете максимален размер на сорс код в байтове, която състезателят може да изпрати като решение на задачата

# Enter_time_limit
source: Enter the time limit (in miliseconds) for this problem
bg: Въведете максимално време в милисекунди, които състезателят може да достигне с решението си върху задачата

# Exact_checker_description
source: - the system compares the results of the participants with the expected output symbol by symbol.
bg: - системата проверява резултатите на състезателя с очаквания изход символ по символ;

source: for
bg: към

# General_info
source: General information
bg: Основна информация

# Precision_checker_description
source: - the system compares only N digits after the decimal separator. Works only for problems where the answers are floating point numbers positioned on new lines.
bg: - само за задачи с резултати съдържащи числа с плаваща запетая на всеки нов ред - системата се съобразява само с първите N на брой цифри след плаващата запетая.

# Problem_group_type_description
source: Choose the type for the group of problems in which the problem is
bg: Изберете типа на групата от задачи в която попада задачата

source: Retest
bg: Ретест

source: Settings
bg: Настройки

# Show_detailed_feedback
source: Choose if the participants can see a full feedback for thier submissions (like administrators)
bg: Изберете дали участниците ще могат да си виждат пълен feedback на решенията си, както го виждат администраторите

# Show_results
source: Choose if the participants can see their result in real time
bg: Изберете дали участниците ще могат да си виждат резултатите в реално време

# Sort_checker_description
source: - the system first sorts the results of the participants and the expected output, line by line and then compares them both symbol by symbol.
bg: - системата първо сортира по линии резултатите на състезателя и очаквания изход и след това ги сравнява символ по символ;

source: Submission types
bg: Видове решения

# Trim_checker_description
source: - the system first removes the white spaces in front and in the end of the participant results and then compare them with the expected output symbol by symbol.
bg: - системата първо премахва празните интервали в началото и края на резултатите на състезателя и след това ги сравнява с очаквания изход символ по символ;
