Repository: NikolayIT/OpenJudgeSystem
Catalog: Open Judge System/Web/OJS.Web/App_GlobalResources/Areas/Contests/Views/Submissions/SubmissionsView.*.resx
Languages: bg

# Answer_correct
source: Correct answer
bg: Верен отговор

# Answer_incorrect
source: Incorrect answer
bg: Грешен отговор

source: Author's profile
bg: Профил на автора

source: Compilation result
bg: Резултат от компилацията

source: Compiled successfully.
bg: Успешна компилация.

# Compile_time_error_occured
source: A compile time error occurred.
bg: Възникнала е грешка по време на компилацията.

source: Delete
bg: Изтриване

source: Execution result
bg: Резултат от изпълнението

source: Home
bg: Начало

source: Memory limit
bg: Недостатъчна памет

source: Retest
bg: Ретест

source: Runtime error
bg: Грешка по време на изпълнение

source: Submissions
bg: Решения

# Submission_in_queue
source: This submission is in queue and will be processed shortly. Please wait.
bg: Решението е в опашката и скоро ще се изпълни. Моля бъдете търпеливи.

# Submission_is_deleted
source: This submission is deleted!!!
bg: Това решение е изтрито!!!

source: Tests
bg: Тестове

source: Time limit
bg: Недостатъчно време

# Title
source: Solution #{0} by {1} for problem
bg: Решение №{0} от {1} към задача

# Update
source: Edit
bg: Промяна

source: View code
bg: Виж кода

source: Memory used
bg: Използвана памет

source: Run #
bg: Изпълнение №

source: Source code
bg: Сорс код

source: Test #
bg: Тест №

source: Time used
bg: Използвано време

source: Zero test #
bg: Нулев тест №

# Zero_tests_not_included_in_result
source: The zero tests are not included in the final result.
bg: Резултатът от нулевите тестове не се включва към крайния резултат.

source: Download binary file
bg: Изтегли бинарен файл

source: Expected output:
bg: Очакван изход:

# Hide_input_text
source: Hide input
bg: Скрий входа

# Show_input_text
source: Show input
bg: Покажи входа

source: Test input:
bg: Вход:

source: Your output:
bg: Твоят изход:

# User_retest_prompt
source: Due to changes in the input/ouput data for this problem, your submission ({0}/{1}) is outdated.<b> By clicking the button below you have the oppurtunity to resend your solution</b>. This will lead to re-evaluation of your solution and you will receive feedback for each of the pre-defined pieces of input data (tests). Please keep in mind that it is possible that your solution will evaluate to a different amount of points due to the aformentioned changes in input/output data. Click the "Retest" button to resend your solution for evaluation!
bg: Решението ({0}/{1}), което сте изпратили на тази задача, е загубило давност заради промяна във входно-изходните данни от страна на администратор.<b> С кликането на бутона по-долу имате възможност да преизпратите решението на ново</b>. Това ще доведе до ново оценяване и съответно обратна връзка за всеки едни от предварително дефинираните входни данни (тестове). Имайте предвид, че е възможно решението да произведе различен брой точки от първоначално получените, заради гореспоменатата промяна в данните. Натиснете "Retest" за да изпратите отново решението!

# Try_submit_again_message_when_no_output
source: The process executing your submission for this test may not have received the output successfully. Please try to submit again the same solution. If the result does not change, then search the error in the submission itself.
bg: Процесът, който изпълнява кода на вашето решение за този тест, може би не е успял да получи изхода успешно. Моля опитайте да качите отново същото решение. Ако резултатът не се променя, потърсете грешката в самото решение.
