Repository: NikolayIT/OpenJudgeSystem
Catalog: Open Judge System/Web/OJS.Web/App_GlobalResources/Areas/Administration/Contests/ContestsControllers.*.resx
Languages: bg

# Active_contest_cannot_edit_duration_type
source: Contest is active and Duration and Type cannot be edited!
bg: Състезанието е активно и продължителността и типа не могат да се променят!

# Active_contest_forbidden_for_deletion
source: Contest is active and cannot be deleted!
bg: Състезанието е активно и не може да бъде изтрито!

# Active_contest_forbidden_for_transfer
source: Contest is active and participants cannot be transferred
bg: Състезанието е активно и не може да се местят участници

# Added_time_to_participants_online
source: Successfully added {0} minutes to the times of all selected active participants in the contest {1}
bg: Успешно добавихте {0} минути към времената на всички избрани активни участници в състезанието {1}

# Added_time_to_single_participant_online
source: Successfully added {0} minutes to the time of the participant with username: {1}, in the contest {2}
bg: Успешно добавихте {0} минути към времeто на участник с потребителско име: {1}, в състезанието {2}

# Contest_added
source: Contest added successfully
bg: Състезанието беше добавено успешно

# Contest_edited
source: Contest edited successfully
bg: Състезанието беше променено успешно

source: Contest not found
bg: Състезанието не е намерено

# Contest_not_valid
source: Contest is not valid
bg: Невалидно състезание

# Contest_start_date_before_end
source: Contest start date must be before the contest end date
bg: Началната дата на състезанието не може да бъде след крайната дата на състезанието

# Duration_invalid_format
source: Duration must be in format "hh:mm"
bg: Продължителността трябва да е във формат "hh:mm"

# Failed_to_update_participants_duration
source: <br />WARNING: The following users' contest duration was not updated because their contest duration would have been reduced below the base contest duration: {0}
bg: <br />ВНИМАНИЕ: Продължителността на състезанието на следните потребители не беше обновена, защото продължителността им би паднала под базовата продължителност на състезанието: {0}

source: No active contests
bg: Няма активни състезания

source: No future contests
bg: Няма бъдещи състезания

source: No latest contests
bg: Нямa последни състезaния

# No_question_by_id
source: Question could not be found by given Id
bg: Не може да се намери въпрос по зададеното Id

# Participants_transferred
source: Participants transferred successfully
bg: Участниците са преместени успешно!

# Participant_not_in_contest
source: The participant is not in the contest!
bg: Участникът не фигурира в състезанието!

# Practice_start_date_before_end
source: Practice start date must be before the practice end date
bg: Началната дата за упражнения не може да бъде след крайната дата за упражнения

# Problem_groups_count_limit
source: Problem groups count cannot be more than {0}
bg: Броят на групи проблеми не може да бъде повече от {0}

# Report_zip_format
source: {1} submissions for {0}.zip
bg: {1} решения за {0}.zip

# Required_field_for_online
source: The field is required for Online Contest
bg: Полето е задължително за Онлайн състезание

# Select_one_submission_type
source: Choose at least one submission type!
bg: Изберете поне един вид решение!

# Subtracted_time_from_participants_online
source: Successfully subtracted {0} minutes from the times of all selected active participants in the contest {1}
bg: Успешно отнехте {0} минути от времената на всички избрани активни участници в състезанието {1}

# Subtracted_time_from_single_participant_online
source: Successfully subtracted {0} minutes from the time of the participant with username: {1}, in the contest {2}
bg: Успешно отнехте {0} минути от времето на участник с потребителско име: {1}, в състезанието {2}
